Revit 2024 API
IFCFileModelOptions Properties
The IFCFileModelOptions type exposes the following members.
Properties
Name | Description
CacheSize
 The cache size of the file.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SchemaFile
 The full name of an IFC schema file.
SchemaName
 The name of the schema.
UserControlledInverses
 Indicates if the inverses are controlled by Revit or users. True by users, false by Revit.
See Also
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace